jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
void schedule(app_sched_event_handler_t handler)
{
    ret_code_t err_code;

    // Signal to event handler to execute sprintf + start UART transmission
    // If there are already events in the queue
    if (imu.evt_scheduled > 0)
    {
        imu.evt_scheduled++;
    }
    // If there are not yet any events in the queue, schedule event. In gpiote_evt_sceduled all callbacks are called
    else
    {
        imu.evt_scheduled++;
        err_code = app_sched_event_put(0, 0, imu_uart_sceduled);
        APP_ERROR_CHECK(err_code);
    }
}


void imu_uart_sceduled(void *p_event_data, uint16_t event_size)
{
    while (imu.evt_scheduled > 0)
    {
        ret_code_t err_code;

        bool read_success = false;

        // NRF_LOG_INFO("App scheduler execute: %d", imu.evt_scheduled);

        char string[1024];

        received_data_t temp;
        uint32_t temp_len = sizeof(temp);

        float quat[4];
        uint32_t quat_len = sizeof(quat);

        if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)&temp, &temp_len) == NRF_SUCCESS)
        {

            // NRF_LOG_INFO("Fifo GET: %d", usr_get_fifo_len(&buffer.received_data_fifo))

            // sprintf(string, "%d w%.3fwa%.3fab%.3fbc%.3fc\n", device_nr[0], quat[0], quat[1], quat[2], quat[3]);

            // If packet contains QUATERNIONS
            if (temp.quat_data_present)
            {
                // sprintf(string, "%d Q   %.3f    %.3f    %.3f    %.3f\n", temp.conn_handle, temp.quat_data.w, temp.quat_data.x, temp.quat_data.y, temp.quat_data.z);
                sprintf(string, "w%.3fwa%.3fab%.3fbc%.3fc\n", temp.quat_data.w, temp.quat_data.x, temp.quat_data.y, temp.quat_data.z);
            }
            else
                // if packet contains RAW DATA
                if (temp.raw_data_present)
            {
                sprintf(string, "%d G %.3f %.3f %.3f        A %.3f %.3f %.3f        M %.3f %.3f %.3f\n", temp.conn_handle, temp.raw_data.gryo.x, temp.raw_data.gryo.y, temp.raw_data.gryo.z, temp.raw_data.accel.x, temp.raw_data.accel.y, temp.raw_data.accel.z, temp.raw_data.mag.x, temp.raw_data.mag.y, temp.raw_data.mag.z);
            }
            // else
                // If packet contains ADC DATA
            //     if (temp.adc_data_present)
            // {
            //     sprintf(string, "%d ADC %.3f\n", temp.conn_handle, temp.adc_data.raw[0]);
            //     NRF_LOG_INFO("To be implemented.");
            // }

            read_success = true;
            imu.evt_scheduled--;
        }

        // Get data from FIFO buffer if data is correctly recognized
        if (read_success)
        {
            uint32_t string_len = calculate_string_len(string);

            // Send data over UART
            uart_queued_tx((uint8_t *)string, &string_len);
        }
    }
}


void usr_ble_print_settings()
{
    uart_print("------------------------------------------\n");
    uart_print("Current settings:\n");
    if (imu.gyro_enabled)
        uart_print("---    Gyroscope enabled\n");
    if (imu.accel_enabled)
        uart_print("---   Accelerometer enabled\n");
    if (imu.mag_enabled)
        uart_print("--- Magnetometer enabled\n");
    if (imu.euler_enabled)
        uart_print("---   Euler angles enabled\n");
    if (imu.quat6_enabled)
        uart_print("---   Quaternions 6 DoF enabled\n");
    if (imu.quat9_enabled)
        uart_print("---   Quaternions 9 DoF enabled\n");
    if (imu.frequency != 0)
    {
        uart_print("---  Sensor frequency:  ");
        char str[5];
        sprintf(str, "%d Hz\n", imu.frequency);
        NRF_LOG_INFO("string: %s", str);
        uart_print(str);
    }
    if (imu.adc)
        uart_print("---   ADC enabled\n");
    if (imu.sync_enabled)
        uart_print("---   Synchonization enabled\n");
    if (imu.wom)
        uart_print("---   WoM enabled\n");
    uart_print("------------------------------------------\n");
}


void usr_ble_print_connection_handles()
{
    ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

    //You can iterate through the list of connection handles:
    for (uint32_t i = 0; i < conn_central_handles.len; i++)
    {
        uint16_t conn_handle = conn_central_handles.conn_handles[i];

        // Print Connected Devices
        uint8_t str[100];
        sprintf(str, "Sensor    %d  --> conn handle  %d\n", (i + 1), conn_handle);
        uart_print(str);
    }
}

uint32_t usr_ble_get_conn_handle_len()
{
    ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

    return conn_central_handles.len;
}

void usr_batt_print_conn_handle()
{
        uart_print("------------------------------------------\n");

        ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

        for (uint32_t i = 0; i < conn_central_handles.len; i++)
        {
            uint16_t conn_handle = conn_central_handles.conn_handles[i];

            // Print Connected Devices
            uint8_t str[100];
            sprintf(str, "Battery level: (conn handle %d)   %0.2f   ( +- %d procent )\n", conn_handle, batt_array.batt[conn_handle].voltage, batt_array.batt[conn_handle].level);
            uart_print(str);
        }
        uart_print("------------------------------------------\n");  
}



void set_config_sync_enable(bool enable)
{
    imu.sync_enabled = enable;
}

void set_config_adc_enable(bool enable)
{
    imu.adc = enable;
}

void set_config_gyro_enable(bool enable)
{
    imu.gyro_enabled = enable;
}

void set_config_accel_enable(bool enable)
{
    imu.accel_enabled = enable;
}

void set_config_mag_enable(bool enable)
{
    imu.mag_enabled = enable;
}

void set_config_quat6_enable(bool enable)
{
    imu.quat6_enabled = enable;
}

void set_config_quat9_enable(bool enable)
{
    imu.quat9_enabled = enable;
}

void set_config_euler_enable(bool enable)
{
    imu.euler_enabled = enable;
}

void set_config_wom_enable(bool enable)
{
    imu.wom = enable;
}

void set_config_frequency(uint32_t freq)
{
    imu.frequency = freq;
}

